nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z82/mcuxpresso/startup_kw45b41z82.cpp
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    SecureFault_Handler,               // The secure fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - KW45B41Z82
    CTI_IRQHandler,            // 16: Cross Trigger Interface interrupt
    CMC0_IRQHandler,           // 17: Core Mode Controller interrupt
    DMA0_CH0_IRQHandler,       // 18: eDMA channel 0 error or transfer complete
    DMA0_CH1_IRQHandler,       // 19: eDMA channel 1 error or transfer complete
    DMA0_CH2_IRQHandler,       // 20: eDMA channel 2 error or transfer complete
    DMA0_CH3_IRQHandler,       // 21: eDMA channel 3 error or transfer complete
    DMA0_CH4_IRQHandler,       // 22: eDMA channel 4 error or transfer complete
    DMA0_CH5_IRQHandler,       // 23: eDMA channel 5 error or transfer complete
    DMA0_CH6_IRQHandler,       // 24: eDMA channel 6 error or transfer complete
    DMA0_CH7_IRQHandler,       // 25: eDMA channel 7 error or transfer complete
    DMA0_CH8_IRQHandler,       // 26: eDMA channel 8 error or transfer complete
    DMA0_CH9_IRQHandler,       // 27: eDMA channel 9 error or transfer complete
    DMA0_CH10_IRQHandler,      // 28: eDMA channel 10 error or transfer complete
    DMA0_CH11_IRQHandler,      // 29: eDMA channel 11 error or transfer complete
    DMA0_CH12_IRQHandler,      // 30: eDMA channel 12 error or transfer complete
    DMA0_CH13_IRQHandler,      // 31: eDMA channel 13 error or transfer complete
    DMA0_CH14_IRQHandler,      // 32: eDMA channel 14 error or transfer complete
    DMA0_CH15_IRQHandler,      // 33: eDMA channel 15 error or transfer complete
    EWM0_IRQHandler,           // 34: External Watchdog Monitor 0 interrupt
    MCM0_IRQHandler,           // 35: Miscellaneous Control Module interrupt
    MSCM0_IRQHandler,          // 36: Miscellaneous System Control Module interrupt
    SPC0_IRQHandler,           // 37: System Power Controller 0 interrupt
    WUU0_IRQHandler,           // 38: Wake-Up Unit 0 interrupt
    WDOG0_IRQHandler,          // 39: Watchdog Timer 0 interrupt
    WDOG1_IRQHandler,          // 40: Watchdog Timer 1 interrupt
    SCG0_IRQHandler,           // 41: System Clock Generator 0 interrupt
    SFA0_IRQHandler,           // 42: Singal Frequency Analyzer 0 interrupt
    FMU0_IRQHandler,           // 43: Flash Memory Unit 0 interrupt
    ELE_CMD_IRQHandler,        // 44: EdgeLock enclave command interface interrupt
    ELE_SECURE_IRQHandler,     // 45: EdgeLock enclave interrupt
    ELE_NONSECURE_IRQHandler,  // 46: EdgeLock enclave non-secure interrupt
    TRDC0_IRQHandler,          // 47: Trusted Resource Domain Controller 0 interrupt
    RTC_Alarm_IRQHandler,      // 48: Real Time Clock 0 alarm interrupt
    RTC_Seconds_IRQHandler,    // 49: Real Time Clock 0 seconds interrupt
    LPTMR0_IRQHandler,         // 50: Low-Power Timer0 interrupt
    LPTMR1_IRQHandler,         // 51: Low-Power Timer1 interrupt
    LPIT0_IRQHandler,          // 52: Low-Power Periodic Interrupt Timer 0 interrupt
    TPM0_IRQHandler,           // 53: Timer / PWM Module 0 interrupt
    TPM1_IRQHandler,           // 54: Timer / PWM Module 1 interrupt
    LPI2C0_IRQHandler,         // 55: Low-Power Inter Integrated Circuit 0 interrupt
    LPI2C1_IRQHandler,         // 56: Low-Power Inter Integrated Circuit 1 interrupt
    I3C0_IRQHandler,           // 57: Improved Inter-Integrated Circuit 0 interrupt
    LPSPI0_IRQHandler,         // 58: Low-Power Serial Peripheral Interface 0 interrupt
    LPSPI1_IRQHandler,         // 59: Low-Power Serial Peripheral Interface 1 interrupt
    LPUART0_IRQHandler,        // 60: Low-Power Universal Asynchronous Receiver/Transmitter 0 interrupt
    LPUART1_IRQHandler,        // 61: Low-Power Universal Asynchronous Receiver/Transmitter 1 interrupt
    FLEXIO0_IRQHandler,        // 62: Flexible Input/Output 0 interrupt
    Reserved63_IRQHandler,     // 63: Reserved interrupt
    RF_IMU0_IRQHandler,        // 64: Radio IMU interrupt 0 (msg_rdy_imu)
    RF_IMU1_IRQHandler,        // 65: Radio IMU interrupt 1(msg_space_avail_imu)
    RF_NBU_IRQHandler,         // 66: Radio NBU timeout interrupt
    RF_FMU_IRQHandler,         // 67: Radio FMU interrupt
    RF_WOR_IRQHandler,         // 68: Radio WOR RX FAIL interrupt
    Reserved69_IRQHandler,     // 69: Reserved interrupt
    RF_Generic_IRQHandler,     // 70: Radio Frequency 2.4 GHz - Generic Link Layer interrupt
    RF_BRIC_IRQHandler,        // 71: Radio Frequency 2.4 GHz - BRIC interrupt
    RF_LANT_SW_IRQHandler,     // 72: Radio Transceiver - Radio LANT_SW interrupt
    RFMC_IRQHandler,           // 73: RFMC interrupt
    DSB_IRQHandler,            // 74: Data Stream Buffer interrupt
    GPIOA_INT0_IRQHandler,     // 75: General Purpose Input/Output A interrupt 0
    GPIOA_INT1_IRQHandler,     // 76: General Purpose Input/Output A interrupt 1
    GPIOB_INT0_IRQHandler,     // 77: General Purpose Input/Output B interrupt 0
    GPIOB_INT1_IRQHandler,     // 78: General Purpose Input/Output B interrupt 1
    GPIOC_INT0_IRQHandler,     // 79: General Purpose Input/Output C interrupt 0
    GPIOC_INT1_IRQHandler,     // 80: General Purpose Input/Output C interrupt 1
    GPIOD_INT0_IRQHandler,     // 81: General Purpose Input/Output D interrupt 0
    GPIOD_INT1_IRQHandler,     // 82: General Purpose Input/Output D interrupt 1
    PORTA_EFT_IRQHandler,      // 83: PortA EFT interrupt
    PORTB_EFT_IRQHandler,      // 84: PortB EFT interrupt
    PORTC_EFT_IRQHandler,      // 85: PortC EFT interrupt
    PORTD_EFT_IRQHandler,      // 86: PortD EFT interrupt
    ADC0_IRQHandler,           // 87: Analog-to-Digital Converter 0 interrupt
    LPCMP0_IRQHandler,         // 88: Low-Power Comparator 0 interrupt
    LPCMP1_IRQHandler,         // 89: Low-Power Comparator 1 interrupt
    VBAT_IRQHandler,           // 90: Smart Power Switch Domain interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile (
        "cpsid i\t\n"
#if !defined(BYPASS_ECC_RAM_INIT)
        "ldr     r0, =0x04000000\t\n"
        "ldr     r1, =.ram_init_ctcm01\t\n"
        "bics.w  r1, #0x10000000\t\n"
        "cmp     r0, r1\t\n"
        "bcc.n   .ram_init_done\t\n"    // Bypass ECC RAM initialization on RAM target, debugger will do the initialization
        ".ram_init_ctcm01:\t\n"         // Initialize ctcm01
        "ldr     r0, =0x4000000\t\n"
        "ldr     r1, =0x4004000\t\n"
        "ldr     r2, =0\t\n"
        "ldr     r3, =0\t\n"
        "ldr     r4, =0\t\n"
        "ldr     r5, =0\t\n"
        ".loop01:\t\n"
        "stmia   r0!, {r2 - r5}\t\n"
        "cmp     r0, r1\t\n"
        "bcc.n   .loop01\t\n"
        "\t\n"
        ".ram_init_stcm012:\t\n"        // Initialize stcm012
        "ldr     r0, =0x20000000\t\n"
        "ldr     r1, =0x20010000\t\n"
        ".loop012:\t\n"
        "stmia   r0!, {r2 - r5}\t\n"
        "cmp     r0, r1\t\n"
        "bcc.n   .loop012\t\n"
        "\t\n"
        ".ram_init_stcm5:\t\n"
        "ldr     r0, =0x2001a000\t\n"
        "ldr     r1, =0x2001c000\t\n"
        ".loop5:\t\n"                   // Initialize stcm5
        "stmia   r0!, {r2 - r5}\t\n"
        "cmp     r0, r1\t\n"
        "bcc.n   .loop5\t\n"
        "\t\n"
        ".ram_init_done:\t\n"
#endif
    );
    // Config VTOR & MSPLIM register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    "MSR MSPLIM, %1       \n"
                    :
                    : "r"(g_pfnVectors), "r"(_vStackBase)
                    : "r0", "r1");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#else
    // Disable Watchdog
    // Write watchdog update key to unlock
    *((volatile unsigned int *)0x4001B004) = 0xD928C520;
    // Set timeout value
    *((volatile unsigned int *)0x4001B008) = 0xFFFF;
    // Now disable watchdog via control register
    volatile unsigned int *WDOG_CS = (unsigned int *) 0x4001B000;
    *WDOG_CS = (*WDOG_CS & ~(1 << 7)) | (1 << 5);
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

